Revit 2027 API
BuiltInFailures.ConnectorFailures.NoSupportKCoefficientTable Property
 "K Coefficient from table" is not supported on connector for the element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoSupportKCoefficientTable { get; }
Public Shared ReadOnly Property NoSupportKCoefficientTable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoSupportKCoefficientTable {
	FailureDefinitionId^ get ();
}
static member NoSupportKCoefficientTable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ConnectorFailures Class
Autodesk.Revit.DB Namespace